src/stubs/subscribe.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:rm="rm:soap">
    <soapenv:Header/>
    <soapenv:Body>
        <rm:subscribeService>
            <inPara>
                <subscriber>
                    <!--Identifier of the subscriber-->
                    <attribute>
                        <key>usrIdentifier</key>
                        <value>{{msisdn}}</value>
                    </attribute>
                </subscriber>
                <subscribedService>
                    <attribute>
                        <key>srvName</key>
                        <value>{{bundle_id}}</value>
                    </attribute>
                    <attribute>
                        <key>srvUsageState</key>
                        <value>1</value>
                    </attribute>
                    <attribute>
                        <key>srvStartDateTime</key>
                        <value>{{start_time}}</value>
                    </attribute>
                    <attribute>
                        <key>srvEndDateTime</key>
                        <value>{{end_time}}</value>
                    </attribute>
                    <attribute>
                        <key>srvRoamingType</key>
                        <value>0</value>
                    </attribute>
                    <attribute>
                        <key>TransactionID</key>
                        <value>{{trans_id}}</value>
                    </attribute>
                </subscribedService>
            </inPara>
        </rm:subscribeService>
    </soapenv:Body>
</soapenv:Envelope>
